### 데이터프레임 컬럼 문자열 다루기

다음 데이터프레임의 'cd' 컬럼의 'A'를 제거하세요.

from pandas import DataFrame  
import numpy as np

data = [  
    {"cd":"A060310", "nm":"3S", "close":"2,920"},  
    {"cd":"A095570", "nm":"AJ네트웍스", "close":"6,250"},  
    {"cd":"A006840", "nm":"AK홀딩스", "close":"29,700"},  
    {"cd":"A054620", "nm":"APS홀딩스", "close":"19,400"}  
]  

df = DataFrame(data=data)

In [6]:
from pandas import DataFrame
import numpy as np

data = [
    {"cd":"A060310", "nm":"3S", "close":"2,920"},
    {"cd":"A095570", "nm":"AJ네트웍스", "close":"6,250"},
    {"cd":"A006840", "nm":"AK홀딩스", "close":"29,700"},
    {"cd":"A054620", "nm":"APS홀딩스", "close":"19,400"}
]
df = DataFrame(data=data)

# 위키백과에서 제시한 답
df['cd'] = df['cd'].str[1:]
df

       cd      nm   close
0  060310      3S   2,920
1  095570  AJ네트웍스   6,250
2  006840   AK홀딩스  29,700
3  054620  APS홀딩스  19,400

### 데이터프레임 문자열 컬럼

위 데이터프레임에서 'close' 컬럼의 콤마를 제거한 후 np.int64 타입으로 변경하세요.

In [6]:
from pandas import DataFrame
import numpy as np

data = [
    {"cd":"A060310", "nm":"3S", "close":"2,920"},
    {"cd":"A095570", "nm":"AJ네트웍스", "close":"6,250"},
    {"cd":"A006840", "nm":"AK홀딩스", "close":"29,700"},
    {"cd":"A054620", "nm":"APS홀딩스", "close":"19,400"}
]
df = DataFrame(data=data)

df['close'] = df['close'].str.replace(",", "", ).astype(np.int64)
df

        cd      nm  close
0  A060310      3S   2920
1  A095570  AJ네트웍스   6250
2  A006840   AK홀딩스  29700
3  A054620  APS홀딩스  19400

### DataFrame dropna

다음 데이터프레임에서 np.nan 값이 있는 모든 행을 제거하세요.

data = [  
    [1, 2, 3],  
    [np.nan, 5, 6],  
    [7, np.nan, 9],  
    [10, 11, np.nan]  
]  

df = pd.DataFrame(data)

In [12]:
import pandas as pd


data = [
    [1, 2, 3],
    [np.nan, 5, 6],
    [7, np.nan, 9],
    [10, 11, np.nan]
]
df = pd.DataFrame(data)

df.dropna(inplace=True) #inplace=True를 해줘야지 수정된 값 반영할 수 있음
df

     0    1    2
0  1.0  2.0  3.0

### dataframe.dropna (subset)

#### subset = 부분집합

다음 데이터프레임에서 col2 컬럼의 값에 NaN이 포함된 행만 제거하세요.

In [13]:
import pandas as pd
import numpy as np

data = [
    [1, 1, np.nan],
    [10, np.nan, 10],
    [2, 3, 4]
]
columns = ['col0', 'col1', 'col2']
df = pd.DataFrame(data, columns=columns)


#위키백과에서 제시한 답
df.dropna(subset='col2')

   col0  col1  col2
1    10   NaN  10.0
2     2   3.0   4.0

### dataframe.fillna

다음 데이터프레임의 NaN값을 0으로 채우세요.


import pandas as pd  
import numpy as np

data = [  
    [1, 1, np.nan],  
    [10, np.nan, 10],  
    [2, 3, 4]  
] 

columns = ['col0', 'col1', 'col2']  
df = pd.DataFrame(data, columns=columns)

In [14]:
import pandas as pd  
import numpy as np

data = [  
    [1, 1, np.nan],  
    [10, np.nan, 10],  
    [2, 3, 4]  
] 

columns = ['col0', 'col1', 'col2']  
df = pd.DataFrame(data, columns=columns)  

df.fillna(0)

   col0  col1  col2
0     1   1.0   0.0
1    10   0.0  10.0
2     2   3.0   4.0

### dataframe.isna()

다음 데이터프레임에서 isna 메서드를 호출해보세요.



import pandas as pd  
import numpy as np

data = [  
    [1, 1, np.nan],  
    [10, np.nan, 10],  
    [2, 3, 4]  
] 

columns = ['col0', 'col1', 'col2']  
df = pd.DataFrame(data, columns=columns)

In [15]:
import pandas as pd  
import numpy as np

data = [  
    [1, 1, np.nan],  
    [10, np.nan, 10],  
    [2, 3, 4]  
] 

columns = ['col0', 'col1', 'col2']  
df = pd.DataFrame(data, columns=columns)  

df.isna()

    col0   col1   col2
0  False  False   True
1  False   True  False
2  False  False  False

### dataframe.notna

위 데이터프레임에 대해서 notna 메서드를 호출해보세요.

In [16]:
df.notna()

   col0   col1   col2
0  True   True  False
1  True  False   True
2  True   True   True

### dataframe replace

다음 데이터프레임에서 0을 100으로 변경하세요.

import pandas as pd  
import numpy as np

data = np.arange(9).reshape(3, 3)  
df = pd.DataFrame(data)

In [17]:
import pandas as pd
import numpy as np

data = np.arange(9).reshape(3, 3)
df = pd.DataFrame(data)
df.replace(0, 100)

     0  1  2
0  100  1  2
1    3  4  5
2    6  7  8

### astype

import pandas as pd

data = {  
    'fruit': ['apple', 'orange', 'orange', 'apple', 'apple', 'apple'],  
    'weight': [1.5, 1.3, 3.7, 2.4, 1.7, 1.8]  
}

df = pd.DataFrame(data)

다음 데이터프레임의 'fruit' 컬럼의 타입을 object에서 category로 변경하세요.

In [26]:
import pandas as pd

data = {  
    'fruit': ['apple', 'orange', 'orange', 'apple', 'apple', 'apple'],  
    'weight': [1.5, 1.3, 3.7, 2.4, 1.7, 1.8]  
}

df = pd.DataFrame(data)

df['fruit'] = df['fruit'].astype('category')

print(df['fruit'].dtype)

category